#version: 0.2
Ġ Ġ
č Ċ
ĠĠ ĠĠ
e n
c o
ĉ ĉ
en t
Ġ !
e r
u t
o n
r e
i t
t e
o c
i n
a l
y y
ĠĠĠĠ ĠĠ
0 0
o r
it y
l oc
m p
ent ity
Ġ m
c t
s e
Ġ i
d e
ĠĠ Ġ
t r
p ut
l i
e x
al entity
loc alentity
a t
er r
r o
c h
Ġ +
Ġ {
Ġ ex
Ġ =
s t
. .
u b
o ut
Ġ c
g e
co de
ĉĉ ĉ
p a
co mp
on ent
Ġi yy
Ġ+ -
comp onent
i d
i on
co m
tr a
out put
p ub
Ġ v
li c
pub lic
Ġ 1
) ;
tra in
00 1
0 1
te x
err or
o b
tex t
a s
c g
t o
o v
Ġ com
00 2
o l
Ġ to
or t
Ġ loc
s c
i z
a se
a n
e ct
in put
g en
co ol
ct cool
ctcool gen
se t
ob j
te d
r ent
pa rent
0 2
c e
c ted
p ro
te cted
at tr
pro tected
i mp
Ġ 2
q u
e w
Ġex p
p t
i l
u p
i de
o id
u r
co re
err ide
.. .
Ġv oid
ov erride
ctcoolgen core
obj ect
d b
Ġ set
ĉĉ ĉĉ
li st
a te
t ur
Ġ (
re tur
retur n
0 7
e c
Ġ d
Ġc yy
Ġ+- -
s er
b ase
imp ort
er y
qu ery
on t
ch an
chan ge
Ġ p
Ġ+- >
code s
e d
Ġ1 5
at ion
output s
Ġi mp
Ġ n
a ut
h or
aut hor
g ro
gro up
i yy
v er
Ġ w
ĉĉ čĊ
Ġd ont
author iz
re as
reas on
co n
in it
Ġ parent
input entity
k e
ct db
en d
( );
i al
authoriz ation
i f
ke y
l as
Ġ s
01 1
iz e
input s
las s
ut e
ec ute
init ial
initial ize
Ġn ew
ser ver
a ge
Ġ "
Ġ 4
Ġ st
0 5
c k
Ġv i
f er
en ce
re fer
02 3
pt ion
Ġst ate
refer ence
m ent
u n
ment s
2 023
r oc
u re
ĉ čĊ
Ġ 07
Ġ inputs
Ġc lass
pa ck
Ġ+-- -
Ġp roc
ed ure
Ġstate ments
pack age
Ġproc edure
m e
t end
Ġ ctcoolgencore
Ġ outputs
Ġ initialize
re a
Ġex ecute
Ġex tend
Ġvi ew
Ġextend s
Ġi sc
r d
co rd
re cord
f o
f il
t er
fil ter
Ġ 3
at a
ov e
00 3
d ata
con text
i pt
l l
r ipt
ĠĠĠĠ ĠĠĠĠ
ub sc
ge t
Ġw h
ubsc ript
ĉĉ ĉĉĉ
ch ec
chec k
ch il
Ġ+ >
chil d
u ser
Ġ o
Ġ <
] ;
in fo
or k
ro ll
Ġw ork
Ġo f
( )
p key
ĠĠĠĠĠĠ Ġ
an d
Ġ2 7
a r
c ase
o t
00 4
entity query
ex ce
ctdb entityquery
exce ption
f a
p e
sc roll
ce s
ĉĉĉ čĊ
ĉĉĉĉ čĊ
rea d
" ,
1 1
b rea
g l
o ption
v al
Ġ return
Ġ group
se ar
ob al
ctcoolgen gl
authorization check
un t
brea k
sear ch
ctcoolgengl obal
Ġ 5
yy y
Ġm ove
Ġ4 6
a m
d ate
o unt
u l
y pe
am ount
0 8
e l
Ġ de
08 1
b er
d ont
m ber
Ġ child
up date
me mber
f ro
m ove
m and
s ubscript
com mand
ctdb query
Ġs ubscript
el se
fro m
h er
i me
n ect
t ime
u e
Ġ2 9
db con
Ġd yyy
ctdb exception
Ġwh en
fa il
nect ion
dbcon nection
s i
Ġ from
in g
move member
u m
Ġ reason
ort s
Ġ2 8
Ġp key
user id
fail ed
i ch
m s
Ġ 9
Ġ ctdbquery
tr ing
db error
un d
fo und
Ġwh ich
ms g
( "
1 0
4 1
a mp
c re
c ces
f ul
n ot
s ful
t ype
u cces
Ġ query
se ver
st amp
as c
time stamp
cre ate
ucces sful
sever ity
) )
e qu
Ġ scroll
00 6
Ġ1 8
Ġ4 9
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
equ al
a x
g er
i st
s ort
t al
Ġ entity
te ger
in val
in teger
al read
pa ces
set subscript
Ġcyy y
Ġs ort
val ue
inval id
alread y
a d
s tring
ĉĉ Ġ
at ch
Ġc atch
02 1
Ġ2 1
ĉĉĉĉ ĉĉ
ad d
- -
3 1
p er
t her
Ġ filter
Ġ else
00 5
ex ist
tra n
ol ation
Ġ2 6
a me
c lass
d it
i sc
n ame
u se
u ll
Ġ reference
Ġ ctdbentityquery
Ġ use
re d
tr y
ex ecute
set dbconnection
Ġexp orts
con dit
Ġ4 5
get name
() );
Ġde si
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
add condit
tran s
Ġdesi red
addcondit ion
" ))
4 0
d i
i m
l b
m it
n um
o k
p li
p search
s up
t key
w it
Ġ userid
Ġ severity
ĠĠĠĠ ĠĠĠĠĠĠ
co ther
in st
Ġc ase
01 2
an ce
pt ype
ĉĉĉĉ ĉĉčĊ
Ġp search
Ġs paces
Ġ3 0
ĉĉĉĉĉ ĠĠĠ
ot her
fa ul
Ġ5 0
mit ted
pli ed
sup plied
wit ch
inst ance
faul t
" ;
0 9
= >
= ",
g n
o re
s uccessful
Ġ -
Ġ >
Ġ }
Ġ public
ĠĠĠĠ Ġ
de fault
Ġ+ =>
error code
Ġimp orts
Ġs uccessful
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
get subscript
get errorcode
Ġ< =
si gn
equal sign
ore case
equalsign orecase
" :
1 5
2 0
5 1
i er
m ax
o per
s witch
Ġ g
Ġ protected
Ġ server
ent if
re ct
00 7
Ġm ax
ct break
Ġi s
ex p
id entif
to tal
Ġto tal
Ġ2 3
Ġ2 5
author ity
authoriz ed
un authorized
Ġ3 1
get max
() )
11 10
11 20
equal s
di rect
im um
012 1
15 0
ier s
oper ation
ctbreak exception
identif iers
getmax imum
direct ion
1 2
c yyy
e t
f et
n ull
s end
Ġ čĊ
Ġ context
Ġ and
er e
ch entity
st at
Ġ1 2
Ġ2 2
Ġ2 4
Ġn ot
ial ect
Ġs end
Ġ4 0
Ġwh ere
fet chentity
0 3
c d
c parent
c key
c search
c instance
f ull
h il
i qu
i olation
l y
p other
s s
s paces
t x
u s
v iolation
w hil
Ġ 0
Ġ b
Ġ on
Ġ or
Ġ li
Ġ type
Ġ cother
Ġ ptype
er mitted
al ue
00 8
00 9
de s
li ent
Ġ= =
Ġc parent
Ġc key
Ġc search
Ġc instance
Ġv alue
Ġ1 1
01 31
01 51
02 11
Ġp other
Ġp ermitted
group ent
group entity
Ġs tring
Ġvi olation
un iqu
Ġ3 4
Ġ3 5
ĠĠĠĠĠĠĠĠ Ġ
get groupentity
() +
Ġ5 5
Ġ9 3
ĠĠĠĠĠĠĠĠĠĠĠĠ Ġ
-- --
per mitted
stat us
ss age
whil e
Ġon ly
Ġli ke
uniqu e
0 41
1 01
1 41
1 31
8 31
9 001
9 05
9 041
9 141
9 831
< =",
a ck
b ack
c mp
c pt
d f
d l
d ialect
f m
h n
l t
l ect
m v
n g
n t
o p
s tr
Ġ text
Ġ list
Ġ roll
Ġ ctcoolgenglobal
Ġ found
Ġ authority
on e
loc ate
se lect
ex cpt
st ar
st op
ĉĉĉ Ġ
Ġ1 6
Ġ1 7
Ġ1 01
ĉĉĉĉ Ġ
Ġ" =",
Ġ" <=",
Ġ3 2
Ġ3 3
Ġ5 3
Ġ5 6
Ġmove member
Ġ9 6
ĉĉĉĉĉĉ ĠĠĠ
Ġ> =
905 1
cmp nt
df lt
dl ng
fm t
hn dlng
Ġroll back
excpt n
star t
) );
1 02
a ch
a pe
c at
c reference
c update
c create
c lient
d o
d er
e sc
e ssage
e ach
f i
g in
h ro
i s
i se
i gin
l e
n ex
o pt
p reference
p update
r b
r codes
r un
s um
t hro
v id
w ise
| |
Ġ tr
Ġ error
Ġ ur
Ġ check
Ġ read
Ġ break
Ġ time
Ġ already
Ġ ctbreakexception
Ġ unique
Ġ each
Ġ ||
Ġ! =
re pe
in d
in ser
in di
ĠĠĠĠĠĠ čĊ
or ted
or der
Ġm essage
se tex
Ġi f
Ġex it
Ġex ist
st d
Ġc ur
Ġc reference
Ġc update
Ġc create
Ġc lient
Ġ1 9
Ġ1 02
Ġ1 03
01 0
01 3
01 5
01 6
01 7
01 8
01 9
cg end
sc end
02 0
02 2
02 7
02 8
Ġ2 0
ĉĉĉĉ ĉĉĉ
ate timestamp
Ġ( !
Ġd ialect
Ġd rcodes
Ġd atetimestamp
ser vid
Ġp reference
Ġp update
Ġs witch
Ġs orted
Ġ4 7
Ġst d
me ssage
Ġ3 6
Ġ3 7
Ġ3 8
Ġ3 9
ata entity
Ġo ther
Ġ< ----
unt il
el d
Ġde scend
Ġ9 4
Ġ9 5
Ġ9 9
10 3
not unique
already exist
add order
im ize
Ġis olation
identifiers get
12 2
12 3
Ġ12 2
Ġ12 3
03 51
Ġb e
Ġb y
Ġor igin
cat or
esc ape
fi eld
nex t
opt imize
thro w
Ġtr ue
Ġcheck sum
Ġtime timestamp
repe at
inser t
indi cator
setex it
Ġexist s
Ġcur rent
cgend ataentity
Ġother wise
Ġ<---- --
Ġdescend ing
alreadyexist s
addorder field
