#version: 0.2
Ġ Ġ
č Ċ
ĠĠ ĠĠ
c o
e n
e r
en t
Ġ !
u t
y y
ĠĠĠĠ ĠĠ
m p
Ġ i
o c
o n
o r
c t
0 0
i t
a l
l oc
e x
r e
i n
i d
er r
it y
Ġ m
ent ity
. .
e ct
co mp
on ent
al entity
loc alentity
comp onent
t r
Ġ c
a t
Ġ ex
i c
Ġ {
Ġ v
Ġi yy
s e
u b
tr a
ĠĠ Ġ
l ic
p ub
Ġ +
tra in
pub lic
co m
Ġ+ -
e d
i z
p r
ĉ ĉ
p ut
o ut
o v
00 1
Ġc yy
err or
Ġ 1
c g
e c
g en
l gen
o b
o lgen
Ġ com
co olgen
ct coolgen
0 1
put s
0 7
j ect
o id
co re
Ġi n
id e
err ide
.. .
Ġv oid
ov erride
ob ject
ctcoolgen core
e w
v er
g e
d e
s er
Ġ loc
01 1
c h
i mp
o t
00 2
ĉ čĊ
Ġ =
or t
ect ed
pr ot
ser ver
prot ected
) ;
s t
co de
Ġex p
i on
Ġ1 5
a se
i al
e m
a s
a ut
h or
t o
at ion
Ġ+- -
Ġ+- >
aut hor
author iz
s c
Ġ w
authoriz ation
a n
2 0
i ew
Ġ to
en d
ut e
it ial
Ġv iew
iz e
ec ute
itial ize
b ase
imp ort
a ge
d at
t ex
u r
out puts
tex t
a c
i yy
p ac
t ur
re tur
retur n
se t
0 5
2 3
k age
l as
n text
r o
t end
u re
Ġ pr
Ġ 07
Ġ ctcoolgencore
Ġ st
co ntext
ent s
Ġi mp
oc ed
Ġc las
at em
Ġex ecute
Ġex tend
Ġin puts
Ġin itialize
Ġ+-- -
20 23
dat a
pac kage
Ġpr oced
Ġst atem
Ġclas s
Ġextend s
Ġproced ure
Ġstatem ents
c e
ec k
ch eck
m e
Ġi sc
or k
Ġw ork
ĉĉ čĊ
f er
i me
t ime
Ġ 2
Ġ 5
Ġ d
Ġ set
en ce
re fer
authorization check
refer ence
( );
Ġ 4
Ġ n
on t
ch an
Ġ2 7
Ġd ont
chan ge
Ġn ew
a mp
st amp
code s
time stamp
g ro
i f
m s
m an
u p
00 3
com man
gro up
ms g
comman d
s tr
ĠĠĠĠ ĠĠĠĠ
00 4
ĉĉ Ġ
Ġ (
h ic
p t
Ġ <
ort s
Ġw hic
Ġ4 6
Ġwhic h
f o
f ro
Ġ s
Ġ fro
in g
in fo
str ing
Ġfro m
1 1
l t
Ġ u
out put
Ġ outputs
Ġ return
Ġ group
ĠĠĠĠ Ġ
in it
Ġcyy y
Ġ4 9
3 1
4 1
c yy
Ġ "
Ġ server
Ġ protected
ĠĠĠĠĠĠ Ġ
00 6
ex ecute
re as
in itialize
Ġm ov
se ver
Ġexp orts
11 20
Ġu se
reas on
sever ity
a u
b er
f au
g l
o k
Ġ }
ob al
ctcoolgen gl
de fau
ial ect
em em
Ġ5 0
cyy y
Ġmov e
ctcoolgengl obal
defau lt
emem ber
0 8
] ;
c d
e s
i pt
m ov
o f
r ipt
s age
t x
v al
Ġ entity
Ġ of
ĠĠĠĠ ĠĠĠĠĠĠĠ
ex p
in val
Ġc ase
ub sc
Ġ+ >
ĉĉ ĉčĊ
ser id
dat e
Ġimp orts
Ġ5 5
ĠĠĠĠĠĠĠĠ Ġ
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
08 1
mov emember
inval id
ubsc ript
0 2
0 41
1 31
1 41
8 31
9 001
9 041
9 141
9 831
c pt
d f
d l
d ialect
f m
h n
i sc
m v
n g
n s
s end
ĉ Ġ
Ġ context
Ġ severity
ĠĠĠĠĠĠ čĊ
on e
00 5
ex ce
ex cpt
tra ns
ĉĉ ĉĠ
Ġ5 6
pt ion
Ġs end
02 1
df lt
dl ng
fm t
hn dlng
exce ption
excpt n
" :
) )
1 5
a k
b re
c ase
e l
e q
r ent
s sage
s ubscript
u al
u serid
w it
Ġ -
Ġ time
Ġ date
Ġ bre
Ġ el
00 7
00 8
00 9
Ġm es
Ġc ur
ĉĉ ĉĉĠ
pac es
set subscript
me ssage
Ġ2 6
Ġd ialect
Ġ< =
Ġs ubscript
Ġs wit
Ġs paces
Ġu serid
15 0
eq ual
Ġtime timestamp
Ġdate timestamp
Ġbre ak
Ġel se
Ġmes sage
Ġcur rent
Ġswit ch
equal s
