#version: 0.2
Ġ Ġ
y y
o r
e r
n t
a t
c o
o n
m p
e x
r or
t r
er ror
e nt
ĠĠ ĠĠ
e t
l o
) ;
i n
co mp
on ent
comp onent
i yy
o a
d at
Ġ =
dat a
ex p
lo c
Ġ (
a l
c yy
d e
at tr
o f
h or
v al
u e
val ue
value of
error iyy
s t
co de
ex t
l a
cyy y
s c
Ġ w
o u
c e
g et
in g
s tr
str ing
Ġ !
i sc
0 0
ĠĠĠĠ Ġ
2 1
e n
c h
a n
r e
Ġ f
( )
nt ext
co ntext
i mp
e d
i a
exp erroriyy
t i
string attr
s hor
shor t
v er
i t
s er
st at
u r
i d
r et
t hor
u thor
() .
i e
i x
Ġf ix
ed stringattr
Ġfix edstringattr
error data
b data
lo bdata
g lobdata
s e
it y
r ou
s et
Ġ i
ur n
m e
Ġ "
Ġ )
a r
3 1
i on
g rou
s w
grou p
at ion
a uthor
c k
ret urn
v ie
vie w
p ar
or t
Ġ iyy
Ġ loc
i z
stat e
author iz
ĠĠ Ġ
0 21
Ġ t
( );
r o
loc erroriyy
ti r
in f
Ġ exp
authoriz ation
tir d
0 1
u m
ĠĠĠĠ ĠĠĠĠ
nt attr
ser ver
Ġi ntattr
Ġ view
d o
n d
ch an
do nt
Ġ );
group context
d i
l l
f er
en ce
fer ence
re ference
u nt
a s
4 1
as on
a ce
Ġ cyyy
tr ace
loc groupcontext
i f
Ġt o
č Ċ
Ġ! =
g en
yy y
authorization inf
in st
an ce
inst ance
get errordata
Ġ errordata
re ason
chan g
get state
getstate data
0 2
l e
component return
componentreturn code
00 1
1 5
1 21
u s
stat us
Ġ n
or k
b le
d ou
dou ble
t ext
de c
code s
ver ity
se verity
par ent
p s
Ġw ork
9 8
error isc
98 31
component severity
componentseverity code
component context
componentcontext string
Ġ 0
d c
component reason
componentreason code
i me
f ou
fou nd
a b
n o
Ġ +
Ġ) {
i l
00 2
b a
g in
i gin
v id
or igin
ĠĠĠĠ ĠĠĠĠĠ
component origin
ser vid
componentorigin servid
e ck
ch eck
ll ba
llba ck
oa uthor
exp isc
ro llback
authorizationinf oauthor
authorizationinfoauthor ity
c at
m an
in di
component rollback
cat or
indi cator
componentrollback indicator
( "
ch il
s um
component check
man d
componentcheck sum
) );
5 1
1 1
n on
ĠĠĠĠ ĠĠĠ
non e
f r
Ġ imp
ie fr
par m
unt ime
iefr untime
iefruntime parm
m mand
co mmand
00 00
ti me
Ġ {
9 1
m a
server data
reference iyy
authorizationinfoauthority status
Ġi f
91 41
n um
Ġ }
Ġ dont
chang e
) )
Ġ 1
i nt
Ġ 8
Ġ trace
Ġ globdata
15 0
ti on
a mp
st amp
| |
Ġ ||
Ġ <
" ,
Ġ isc
parent p
er ed
co unt
error en
ered sw
count eredsw
erroren counteredsw
u ll
Ġn ull
51 2
c ur
r ent
cur rent
u se
attr text
set current
setcurrent ab
o k
imp erroriyy
Ġ stringattr
( (
m ent
Ġ+ -
comp a
time stamp
Ġ tird
loc dont
get instance
rou nd
chang er
locdont changer
b er
loc errorisc
la st
set last
state ment
num ber
statement number
Ġ set
Ġ( (
" ));
) (
e instance
f re
h i
Ġw hi
ort s
fre einstance
Ġwhi ch
e y
Ġ cyy
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġ double
Ġdouble attr
u n
Ġf ro
02 21
Ġfro m
1 31
ser id
chil d
9 001
e c
imp isc
Ġ ent
Ġent ity
reference id
o ver
m s
dat e
01 21
chil dc
s u
Ġ timestamp
ms g
su b
Ġtimestamp attr
serverdata server
a di
k ey
p tion
ex ce
codes q
adi m
exce ption
9 0
et urn
locdontchanger eturn
l t
u serid
loc referenceiyy
e w
f lo
h ro
s en
w sw
Ġ ab
view over
Ġn ew
flo wsw
hro w
sen d
Ġab exception
viewover flowsw
2 0
Ġ 5
ex it
Ġ+- -
key attrtext
setlast statementnumber
! (
a c
e q
s f
u al
Ġ return
get status
get errorencounteredsw
get viewoverflowsw
imp parentp
set errorencounteredsw
Ġ) ))
Ġ(( !(
ec t
eq ual
equal s
inf o
Ġ< =
0 3
2 02
a me
b loc
n ame
exp referenceiyy
Ġexp orts
002 202
tion bloc
use ac
setcurrentab id
setcurrentab name
tionbloc k
useac tionblock
(); }
a u
f au
de fau
authorizationinf o
defau lt
g context
y p
Ġ compa
al l
ext text
get exttext
re exit
ret o
chan getexttext
dont changetexttext
compa reto
gcontext dontchangetexttext
Ġcompa reexit
1 0
Ġ c
loc imperroriyy
al ect
di alect
instance id
" )
l i
Ġ 9
Ġ >
m o
); }
component send
Ġ= =
exp errorisc
imp errorisc
imp command
Ġ+ >
componentsend command
impcommand iyy
0 9
e l
01 11
el se
, (
Ġ of
serverdata referenceid
msg iyy
a se
01 31
Ġ+- >
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
90 41
e sc
f la
exp all
loc gcontextdontchangetexttext
al se
Ġf alse
02 31
002 09
Ġimp orts
un c
locdontchangereturn codesq
03 21
fla g
00209 7
021 1
11 10
setlast sub
setlastsub statementnumber
p t
t hrow
02 41
& &
i pt
r ipt
Ġ sub
Ġ &&
sc ript
imp childc
Ġt ext
01 41
Ġsub script
o p
t yp
v e
Ġ parent
er ation
authoriz ed
un authorized
Ġc ase
mo ve
op eration
1 7
; }
Ġ child
Ġ else
ĠĠĠĠĠĠĠĠ ĠĠĠ
0000 0000
11 20
002097 2
e ason
Ġ short
error msgiyy
locdontchanger eason
17 3
locdontchangereason codesq
a in
b j
c re
h er
o bj
t her
Ġ iefruntimeparm
at e
se ar
Ġt hrow
codes n
ma int
locdontchangereturn codesn
002202 01
li ent
cre ate
sear ch
maint ain
g v
r gv
serverdataserver time
serverdataserver date
173 01
rgv c
s s
t ok
Ġ use
en id
Ġf unc
0000 00
authorizationinfo tok
typ et
search attrtext
authorizationinfotok enid
+ -
2 5
parentp keyattrtext
90 51
c d
p date
u pdate
Ġ move
tr an
me ss
ck ey
ime stamp
ther attrtext
tran s
mess a
a d
Ġ 3
in it
re ad
author ity
Ġloc groupcontext
+- >
t s
in val
component messa
attr num
get x
ti d
serverdata userid
child ckey
ec tid
expall childc
obj ectid
inval id
componentmessa getx
childckey attrnum
Ġ reason
Ġ send
exp childc
3 9
Ġ adim
et imestamp
component dialect
exp errormsgiyy
ou serid
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
authorizationinf ouserid
)); }
serverdataserver timestamp
componentdialect cd
0 31
0 51
exp parentp
impparentp keyattrtext
unauthorized operation
typet keyattrtext
+ (
t o
Ġ group
context iyy
imp referenceiyy
Ġ+ +(
authorizationinfoauthoritystatus u
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
0 8
^ =
c lient
f unc
u ser
Ġ time
Ġ date
Ġ authority
Ġ ^=
get client
() ,
imp dialect
imp childckeyattrnum
021 9
01 1
authorizationinfoauthoritystatus r
002202 0219
Ġc lient
li st
impchildc parentpkeyattrtext
00220201 39
17301 5
Ġtime attr
Ġdate attr
getclient userid
impdialect iyy
0 6
3 2
6 1
a y
d u
d ay
l et
o therattrtext
s ion
w ork
in d
exp msgiyy
de let
ing un
it num
01 61
authorizationinf over
le id
authorizationinfoauthority objectid
authorizationinfoauthority ind
authorizationinfoauthoritystatus d
authorizationinfoauthoritystatus l
authorizationinfo mo
authorizationinfo work
);} }
expall parentp
du leid
delet e
ingun itnum
authorizationinfover sion
authorizationinfomo duleid
authorizationinfowork ingunitnum
0 41
m en
Ġ context
loc errormsgiyy
if i
impparentp instanceid
men u
8 4
c ation
s p
Ġ .
Ġ userid
co therattrtext
loc contextiyy
Ġf or
imp group
imp gcontextdontchangetexttext
child cotherattrtext
impchildc instanceid
create userid
17301 512
update userid
invalid command
impgroup trans
( -
0 4
2 8
h il
m in
m etimestamp
t er
t sc
Ġ -
dat etimestamp
exp al
exp tsc
ti metimestamp
lt yp
002202 03
00220201 84
to day
08 2
173015 082
hil dc
min ation
ter mination
expal ltyp
exptsc hildc
0 5
4 4
] ,
c ase
f p
g trans
Ġ 2
Ġ ;
Ġ server
Ġ severity
exp ort
imp gtrans
set viewoverflowsw
set exit
)) {
impparentp searchattrtext
impparentp typetkeyattrtext
impparentp otherattrtext
ect info
yp e
typ e
00000000 3
obj ectinfo
000000 002
authority objectinfo
17301512 3
expalltyp et
impgtrans isc
authorityobjectinfo objectid
2 3
8 8
d f
m v
} }
Ġ '
er s
ent ifi
exp typet
exp ts
id entifi
Ġt ype
tir dat
ma in
0020972 9
000000 01
00220203 28
today st
expts parentp
identifi ers
a p
f or
h nd
i se
l n
o ther
p li
p read
w ise
Ġ sp
Ġ other
component imp
component sp
exp contextiyy
st d
imp groupcontext
imp childcotherattrtext
ation id
tir f
ace s
le ment
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ec ifi
impparentp referenceid
002097 3
impchildc referenceid
impchildc searchattrtext
00000000 5
00000000 8
00220201 06
000000 001
000000 011
expallchildc referenceid
expallchildc instanceid
expchildc referenceid
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
cation id
exptschildc referenceid
df lt
ap pli
hnd ln
Ġsp aces
Ġother wise
componentimp lement
componentsp ecifi
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
appli cation
hndln g
componentimplement ationid
componentspecifi cationid
! =
0 7
e m
s y
s date
exp parentpkeyattrtext
exp identifiers
loc imp
loc impparentpkeyattrtext
attr mand
st em
get sy
00 6
00 8
() );}
() !=
Ġto day
time value
Ġ} }
date value
();} }
;} }
00000000 9
00000000 44
0020972 8
expchildc instanceid
expparentp referenceid
expparentp instanceid
expparentp searchattrtext
datetimestamp datevalue
timetimestamp timevalue
exptschildc instanceid
export datetimestampdatevalue
export timetimestamptimevalue
todayst imestamp
exptsparentp referenceid
expidentifiers iyy
getsy stem
1 2
1 3
1 4
1 6
1 8
1 9
2 2
2 4
2 6
2 7
2 9
3 0
5 6
7 4
d t
e mp
e ference
g e
i ss
m ts
m iss
o llback
p key
q ue
r b
t x
t y
t mts
v ity
Ġ ex
Ġ state
Ġ exit
Ġ dialect
Ġ ;}
Ġ ckey
Ġ messa
Ġ datetimestamp
Ġ timetimestamp
Ġ tirdat
Ġ std
or y
tr eference
tr ollback
ĠĠĠĠ ĠĠ
ĠĠĠĠ čĊ
component ac
dat ory
exp childckeyattrnum
exp childcotherattrtext
loc impparentpinstanceid
st ed
re set
re que
imp ort
ti vity
se attr
se trollback
Ġi s
Ġ" ;}
31 1
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
02 39
15 4
ba seattr
man datory
51 88
Ġ} }}
Ġ1 06
Ġ1 04
Ġ1 05
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
msg type
key attrmand
info msg
002202 0239
10 4
10 5
10 6
Ġ> =
expall childckeyattrnum
expall childcotherattrtext
002097 173
00000000 41
0020972 5
0020972 23
0020972 88
0020972 311
17301 5188
typet instanceid
+- -
Ġ3 0
expallchildc searchattrtext
expallchildc parentpkeyattrtext
expallchildc createuserid
expallchildc updateuserid
expchildc searchattrtext
expchildc parentpkeyattrtext
expchildc createuserid
expchildc updateuserid
173015 05
173015 154
);}} }
);}} }}
expallparentp referenceid
expallparentp instanceid
expallparentp typetkeyattrtext
17301512 0
00220203 44
today sdate
setexit state
setexit msgtype
setexit infomsg
000000003 0
000000003 7
000000002 3
000000002 7
todayst ime
exptsparentp instanceid
std return
tirf dt
tirf tmts
000000005 7
000000005 9
000000011 8
locimp typetkeyattrtext
Ġtoday st
emp ty
miss ing
Ġmessa ge
treference id
componentac tivity
reque sted
setrollback requested
002097173 5
002097223 3
17301505 6
tirfdt ts
componentactivity cd
