{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"en":264,"co":265,"ĉĉ":266,"ent":267,"Ġ!":268,"er":269,"ut":270,"on":271,"re":272,"it":273,"te":274,"oc":275,"in":276,"al":277,"yy":278,"ĠĠĠĠĠĠ":279,"00":280,"or":281,"ity":282,"loc":283,"mp":284,"entity":285,"Ġm":286,"ct":287,"se":288,"Ġi":289,"de":290,"ĠĠĠ":291,"tr":292,"put":293,"li":294,"ex":295,"alentity":296,"localentity":297,"at":298,"err":299,"ro":300,"ch":301,"Ġ+":302,"Ġ{":303,"Ġex":304,"Ġ=":305,"st":306,"..":307,"ub":308,"out":309,"Ġc":310,"ge":311,"code":312,"ĉĉĉ":313,"pa":314,"comp":315,"onent":316,"Ġiyy":317,"Ġ+-":318,"component":319,"id":320,"ion":321,"com":322,"tra":323,"output":324,"pub":325,"Ġv":326,"lic":327,"public":328,"Ġ1":329,");":330,"train":331,"001":332,"01":333,"tex":334,"error":335,"ob":336,"text":337,"as":338,"cg":339,"to":340,"ov":341,"Ġcom":342,"002":343,"ol":344,"Ġto":345,"ort":346,"Ġloc":347,"sc":348,"iz":349,"ase":350,"an":351,"ect":352,"input":353,"gen":354,"cool":355,"ctcool":356,"ctcoolgen":357,"set":358,"obj":359,"ted":360,"rent":361,"parent":362,"02":363,"ce":364,"cted":365,"pro":366,"tected":367,"attr":368,"protected":369,"imp":370,"Ġ2":371,"qu":372,"ew":373,"Ġexp":374,"pt":375,"il":376,"up":377,"ide":378,"oid":379,"ur":380,"core":381,"erride":382,"...":383,"Ġvoid":384,"override":385,"ctcoolgencore":386,"object":387,"db":388,"Ġset":389,"ĉĉĉĉ":390,"list":391,"ate":392,"tur":393,"Ġ(":394,"retur":395,"return":396,"07":397,"ec":398,"Ġd":399,"Ġcyy":400,"Ġ+--":401,"ser":402,"base":403,"import":404,"ery":405,"query":406,"ont":407,"chan":408,"change":409,"Ġp":410,"Ġ+->":411,"codes":412,"ed":413,"Ġ15":414,"ation":415,"outputs":416,"Ġimp":417,"Ġn":418,"aut":419,"hor":420,"author":421,"gro":422,"group":423,"iyy":424,"ver":425,"Ġw":426,"ĉĉčĊ":427,"Ġdont":428,"authoriz":429,"reas":430,"reason":431,"con":432,"init":433,"Ġparent":434,"inputentity":435,"ke":436,"ctdb":437,"end":438,"();":439,"ial":440,"authorization":441,"if":442,"key":443,"las":444,"Ġs":445,"011":446,"ize":447,"inputs":448,"lass":449,"ute":450,"ecute":451,"initial":452,"initialize":453,"Ġnew":454,"server":455,"age":456,"Ġ\"":457,"Ġ4":458,"Ġst":459,"05":460,"ck":461,"Ġvi":462,"fer":463,"ence":464,"refer":465,"023":466,"ption":467,"Ġstate":468,"reference":469,"ment":470,"un":471,"ments":472,"2023":473,"roc":474,"ure":475,"ĉčĊ":476,"Ġ07":477,"Ġinputs":478,"Ġclass":479,"pack":480,"Ġ+---":481,"Ġproc":482,"edure":483,"Ġstatements":484,"package":485,"Ġprocedure":486,"me":487,"tend":488,"Ġctcoolgencore":489,"Ġoutputs":490,"Ġinitialize":491,"rea":492,"Ġexecute":493,"Ġextend":494,"Ġview":495,"Ġextends":496,"Ġisc":497,"rd":498,"cord":499,"record":500,"fo":501,"fil":502,"ter":503,"filter":504,"Ġ3":505,"ata":506,"ove":507,"003":508,"data":509,"context":510,"ipt":511,"ll":512,"ript":513,"ĠĠĠĠĠĠĠĠ":514,"ubsc":515,"get":516,"Ġwh":517,"ubscript":518,"ĉĉĉĉĉ":519,"chec":520,"check":521,"chil":522,"Ġ+>":523,"child":524,"user":525,"Ġo":526,"Ġ<":527,"];":528,"info":529,"ork":530,"roll":531,"Ġwork":532,"Ġof":533,"()":534,"pkey":535,"ĠĠĠĠĠĠĠ":536,"and":537,"Ġ27":538,"ar":539,"case":540,"ot":541,"004":542,"entityquery":543,"exce":544,"ctdbentityquery":545,"exception":546,"fa":547,"pe":548,"scroll":549,"ces":550,"ĉĉĉčĊ":551,"ĉĉĉĉčĊ":552,"read":553,"\",":554,"11":555,"brea":556,"gl":557,"option":558,"val":559,"Ġreturn":560,"Ġgroup":561,"sear":562,"obal":563,"ctcoolgengl":564,"authorizationcheck":565,"unt":566,"break":567,"search":568,"ctcoolgenglobal":569,"Ġ5":570,"yyy":571,"Ġmove":572,"Ġ46":573,"am":574,"date":575,"ount":576,"ul":577,"ype":578,"amount":579,"08":580,"el":581,"Ġde":582,"081":583,"ber":584,"dont":585,"mber":586,"Ġchild":587,"update":588,"member":589,"fro":590,"move":591,"mand":592,"subscript":593,"command":594,"ctdbquery":595,"Ġsubscript":596,"else":597,"from":598,"her":599,"ime":600,"nect":601,"time":602,"ue":603,"Ġ29":604,"dbcon":605,"Ġdyyy":606,"ctdbexception":607,"Ġwhen":608,"fail":609,"nection":610,"dbconnection":611,"si":612,"Ġfrom":613,"ing":614,"movemember":615,"um":616,"Ġreason":617,"orts":618,"Ġ28":619,"Ġpkey":620,"userid":621,"failed":622,"ich":623,"ms":624,"Ġ9":625,"Ġctdbquery":626,"tring":627,"dberror":628,"und":629,"found":630,"Ġwhich":631,"msg":632,"(\"":633,"10":634,"41":635,"amp":636,"cre":637,"cces":638,"ful":639,"not":640,"sful":641,"type":642,"ucces":643,"Ġquery":644,"sever":645,"stamp":646,"asc":647,"timestamp":648,"create":649,"uccessful":650,"severity":651,"))":652,"equ":653,"Ġscroll":654,"006":655,"Ġ18":656,"Ġ49":657,"ĠĠĠĠĠĠĠĠĠĠĠĠ":658,"equal":659,"ax":660,"ger":661,"ist":662,"sort":663,"tal":664,"Ġentity":665,"teger":666,"inval":667,"integer":668,"alread":669,"paces":670,"setsubscript":671,"Ġcyyy":672,"Ġsort":673,"value":674,"invalid":675,"already":676,"ad":677,"string":678,"ĉĉĠ":679,"atch":680,"Ġcatch":681,"021":682,"Ġ21":683,"ĉĉĉĉĉĉ":684,"add":685,"--":686,"31":687,"per":688,"ther":689,"Ġfilter":690,"Ġelse":691,"005":692,"exist":693,"tran":694,"olation":695,"Ġ26":696,"ame":697,"class":698,"dit":699,"isc":700,"name":701,"use":702,"ull":703,"Ġreference":704,"Ġctdbentityquery":705,"Ġuse":706,"red":707,"try":708,"execute":709,"setdbconnection":710,"Ġexports":711,"condit":712,"Ġ45":713,"getname":714,"());":715,"Ġdesi":716,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":717,"addcondit":718,"trans":719,"Ġdesired":720,"addcondition":721,"\"))":722,"40":723,"di":724,"im":725,"lb":726,"mit":727,"num":728,"ok":729,"pli":730,"psearch":731,"sup":732,"tkey":733,"wit":734,"Ġuserid":735,"Ġseverity":736,"ĠĠĠĠĠĠĠĠĠĠ":737,"cother":738,"inst":739,"Ġcase":740,"012":741,"ance":742,"ptype":743,"ĉĉĉĉĉĉčĊ":744,"Ġpsearch":745,"Ġspaces":746,"Ġ30":747,"ĉĉĉĉĉĠĠĠ":748,"other":749,"faul":750,"Ġ50":751,"mitted":752,"plied":753,"supplied":754,"witch":755,"instance":756,"fault":757,"\";":758,"09":759,"=>":760,"=\",":761,"gn":762,"ore":763,"successful":764,"Ġ-":765,"Ġ>":766,"Ġ}":767,"Ġpublic":768,"ĠĠĠĠĠ":769,"default":770,"Ġ+=>":771,"errorcode":772,"Ġimports":773,"Ġsuccessful":774,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":775,"getsubscript":776,"geterrorcode":777,"Ġ<=":778,"sign":779,"equalsign":780,"orecase":781,"equalsignorecase":782,"\":":783,"15":784,"20":785,"51":786,"ier":787,"max":788,"oper":789,"switch":790,"Ġg":791,"Ġprotected":792,"Ġserver":793,"entif":794,"rect":795,"007":796,"Ġmax":797,"ctbreak":798,"Ġis":799,"exp":800,"identif":801,"total":802,"Ġtotal":803,"Ġ23":804,"Ġ25":805,"authority":806,"authorized":807,"unauthorized":808,"Ġ31":809,"getmax":810,"())":811,"1110":812,"1120":813,"equals":814,"direct":815,"imum":816,"0121":817,"150":818,"iers":819,"operation":820,"ctbreakexception":821,"identifiers":822,"getmaximum":823,"direction":824,"12":825,"cyyy":826,"et":827,"fet":828,"null":829,"send":830,"ĠčĊ":831,"Ġcontext":832,"Ġand":833,"ere":834,"chentity":835,"stat":836,"Ġ12":837,"Ġ22":838,"Ġ24":839,"Ġnot":840,"ialect":841,"Ġsend":842,"Ġ40":843,"Ġwhere":844,"fetchentity":845,"03":846,"cd":847,"cparent":848,"ckey":849,"csearch":850,"cinstance":851,"full":852,"hil":853,"iqu":854,"iolation":855,"ly":856,"pother":857,"ss":858,"spaces":859,"tx":860,"us":861,"violation":862,"whil":863,"Ġ0":864,"Ġb":865,"Ġon":866,"Ġor":867,"Ġli":868,"Ġtype":869,"Ġcother":870,"Ġptype":871,"ermitted":872,"alue":873,"008":874,"009":875,"des":876,"lient":877,"Ġ==":878,"Ġcparent":879,"Ġckey":880,"Ġcsearch":881,"Ġcinstance":882,"Ġvalue":883,"Ġ11":884,"0131":885,"0151":886,"0211":887,"Ġpother":888,"Ġpermitted":889,"groupent":890,"groupentity":891,"Ġstring":892,"Ġviolation":893,"uniqu":894,"Ġ34":895,"Ġ35":896,"ĠĠĠĠĠĠĠĠĠ":897,"getgroupentity":898,"()+":899,"Ġ55":900,"Ġ93":901,"ĠĠĠĠĠĠĠĠĠĠĠĠĠ":902,"----":903,"permitted":904,"status":905,"ssage":906,"while":907,"Ġonly":908,"Ġlike":909,"unique":910,"041":911,"101":912,"141":913,"131":914,"831":915,"9001":916,"905":917,"9041":918,"9141":919,"9831":920,"<=\",":921,"ack":922,"back":923,"cmp":924,"cpt":925,"df":926,"dl":927,"dialect":928,"fm":929,"hn":930,"lt":931,"lect":932,"mv":933,"ng":934,"nt":935,"op":936,"str":937,"Ġtext":938,"Ġlist":939,"Ġroll":940,"Ġctcoolgenglobal":941,"Ġfound":942,"Ġauthority":943,"one":944,"locate":945,"select":946,"excpt":947,"star":948,"stop":949,"ĉĉĉĠ":950,"Ġ16":951,"Ġ17":952,"Ġ101":953,"ĉĉĉĉĠ":954,"Ġ\"=\",":955,"Ġ\"<=\",":956,"Ġ32":957,"Ġ33":958,"Ġ53":959,"Ġ56":960,"Ġmovemember":961,"Ġ96":962,"ĉĉĉĉĉĉĠĠĠ":963,"Ġ>=":964,"9051":965,"cmpnt":966,"dflt":967,"dlng":968,"fmt":969,"hndlng":970,"Ġrollback":971,"excptn":972,"start":973,"));":974,"102":975,"ach":976,"ape":977,"cat":978,"creference":979,"cupdate":980,"ccreate":981,"client":982,"do":983,"der":984,"esc":985,"essage":986,"each":987,"fi":988,"gin":989,"hro":990,"is":991,"ise":992,"igin":993,"le":994,"nex":995,"opt":996,"preference":997,"pupdate":998,"rb":999,"rcodes":1000,"run":1001,"sum":1002,"thro":1003,"vid":1004,"wise":1005,"||":1006,"Ġtr":1007,"Ġerror":1008,"Ġur":1009,"Ġcheck":1010,"Ġread":1011,"Ġbreak":1012,"Ġtime":1013,"Ġalready":1014,"Ġctbreakexception":1015,"Ġunique":1016,"Ġeach":1017,"Ġ||":1018,"Ġ!=":1019,"repe":1020,"ind":1021,"inser":1022,"indi":1023,"ĠĠĠĠĠĠčĊ":1024,"orted":1025,"order":1026,"Ġmessage":1027,"setex":1028,"Ġif":1029,"Ġexit":1030,"Ġexist":1031,"std":1032,"Ġcur":1033,"Ġcreference":1034,"Ġcupdate":1035,"Ġccreate":1036,"Ġclient":1037,"Ġ19":1038,"Ġ102":1039,"Ġ103":1040,"010":1041,"013":1042,"015":1043,"016":1044,"017":1045,"018":1046,"019":1047,"cgend":1048,"scend":1049,"020":1050,"022":1051,"027":1052,"028":1053,"Ġ20":1054,"ĉĉĉĉĉĉĉ":1055,"atetimestamp":1056,"Ġ(!":1057,"Ġdialect":1058,"Ġdrcodes":1059,"Ġdatetimestamp":1060,"servid":1061,"Ġpreference":1062,"Ġpupdate":1063,"Ġswitch":1064,"Ġsorted":1065,"Ġ47":1066,"Ġstd":1067,"message":1068,"Ġ36":1069,"Ġ37":1070,"Ġ38":1071,"Ġ39":1072,"ataentity":1073,"Ġother":1074,"Ġ<----":1075,"until":1076,"eld":1077,"Ġdescend":1078,"Ġ94":1079,"Ġ95":1080,"Ġ99":1081,"103":1082,"notunique":1083,"alreadyexist":1084,"addorder":1085,"imize":1086,"Ġisolation":1087,"identifiersget":1088,"122":1089,"123":1090,"Ġ122":1091,"Ġ123":1092,"0351":1093,"Ġbe":1094,"Ġby":1095,"Ġorigin":1096,"cator":1097,"escape":1098,"field":1099,"next":1100,"optimize":1101,"throw":1102,"Ġtrue":1103,"Ġchecksum":1104,"Ġtimetimestamp":1105,"repeat":1106,"insert":1107,"indicator":1108,"setexit":1109,"Ġexists":1110,"Ġcurrent":1111,"cgendataentity":1112,"Ġotherwise":1113,"Ġ<------":1114,"Ġdescending":1115,"alreadyexists":1116,"addorderfield":1117}