{"<s>":0,"<pad>":1,"</s>":2,"<unk>":3,"<mask>":4,"!":5,"\"":6,"#":7,"$":8,"%":9,"&":10,"'":11,"(":12,")":13,"*":14,"+":15,",":16,"-":17,".":18,"/":19,"0":20,"1":21,"2":22,"3":23,"4":24,"5":25,"6":26,"7":27,"8":28,"9":29,":":30,";":31,"<":32,"=":33,">":34,"?":35,"@":36,"A":37,"B":38,"C":39,"D":40,"E":41,"F":42,"G":43,"H":44,"I":45,"J":46,"K":47,"L":48,"M":49,"N":50,"O":51,"P":52,"Q":53,"R":54,"S":55,"T":56,"U":57,"V":58,"W":59,"X":60,"Y":61,"Z":62,"[":63,"\\":64,"]":65,"^":66,"_":67,"`":68,"a":69,"b":70,"c":71,"d":72,"e":73,"f":74,"g":75,"h":76,"i":77,"j":78,"k":79,"l":80,"m":81,"n":82,"o":83,"p":84,"q":85,"r":86,"s":87,"t":88,"u":89,"v":90,"w":91,"x":92,"y":93,"z":94,"{":95,"|":96,"}":97,"~":98,"¡":99,"¢":100,"£":101,"¤":102,"¥":103,"¦":104,"§":105,"¨":106,"©":107,"ª":108,"«":109,"¬":110,"®":111,"¯":112,"°":113,"±":114,"²":115,"³":116,"´":117,"µ":118,"¶":119,"·":120,"¸":121,"¹":122,"º":123,"»":124,"¼":125,"½":126,"¾":127,"¿":128,"À":129,"Á":130,"Â":131,"Ã":132,"Ä":133,"Å":134,"Æ":135,"Ç":136,"È":137,"É":138,"Ê":139,"Ë":140,"Ì":141,"Í":142,"Î":143,"Ï":144,"Ð":145,"Ñ":146,"Ò":147,"Ó":148,"Ô":149,"Õ":150,"Ö":151,"×":152,"Ø":153,"Ù":154,"Ú":155,"Û":156,"Ü":157,"Ý":158,"Þ":159,"ß":160,"à":161,"á":162,"â":163,"ã":164,"ä":165,"å":166,"æ":167,"ç":168,"è":169,"é":170,"ê":171,"ë":172,"ì":173,"í":174,"î":175,"ï":176,"ð":177,"ñ":178,"ò":179,"ó":180,"ô":181,"õ":182,"ö":183,"÷":184,"ø":185,"ù":186,"ú":187,"û":188,"ü":189,"ý":190,"þ":191,"ÿ":192,"Ā":193,"ā":194,"Ă":195,"ă":196,"Ą":197,"ą":198,"Ć":199,"ć":200,"Ĉ":201,"ĉ":202,"Ċ":203,"ċ":204,"Č":205,"č":206,"Ď":207,"ď":208,"Đ":209,"đ":210,"Ē":211,"ē":212,"Ĕ":213,"ĕ":214,"Ė":215,"ė":216,"Ę":217,"ę":218,"Ě":219,"ě":220,"Ĝ":221,"ĝ":222,"Ğ":223,"ğ":224,"Ġ":225,"ġ":226,"Ģ":227,"ģ":228,"Ĥ":229,"ĥ":230,"Ħ":231,"ħ":232,"Ĩ":233,"ĩ":234,"Ī":235,"ī":236,"Ĭ":237,"ĭ":238,"Į":239,"į":240,"İ":241,"ı":242,"Ĳ":243,"ĳ":244,"Ĵ":245,"ĵ":246,"Ķ":247,"ķ":248,"ĸ":249,"Ĺ":250,"ĺ":251,"Ļ":252,"ļ":253,"Ľ":254,"ľ":255,"Ŀ":256,"ŀ":257,"Ł":258,"ł":259,"Ń":260,"ĠĠ":261,"čĊ":262,"ĠĠĠĠ":263,"co":264,"en":265,"er":266,"ent":267,"Ġ!":268,"ut":269,"yy":270,"ĠĠĠĠĠĠ":271,"mp":272,"Ġi":273,"oc":274,"on":275,"or":276,"ct":277,"00":278,"it":279,"al":280,"loc":281,"ex":282,"re":283,"in":284,"id":285,"err":286,"ity":287,"Ġm":288,"entity":289,"..":290,"ect":291,"comp":292,"onent":293,"alentity":294,"localentity":295,"component":296,"tr":297,"Ġc":298,"at":299,"Ġex":300,"ic":301,"Ġ{":302,"Ġv":303,"Ġiyy":304,"se":305,"ub":306,"tra":307,"ĠĠĠ":308,"lic":309,"pub":310,"Ġ+":311,"train":312,"public":313,"com":314,"Ġ+-":315,"ed":316,"iz":317,"pr":318,"ĉĉ":319,"put":320,"out":321,"ov":322,"001":323,"Ġcyy":324,"error":325,"Ġ1":326,"cg":327,"ec":328,"gen":329,"lgen":330,"ob":331,"olgen":332,"Ġcom":333,"coolgen":334,"ctcoolgen":335,"01":336,"puts":337,"07":338,"ject":339,"oid":340,"core":341,"Ġin":342,"ide":343,"erride":344,"...":345,"Ġvoid":346,"override":347,"object":348,"ctcoolgencore":349,"ew":350,"ver":351,"ge":352,"de":353,"ser":354,"Ġloc":355,"011":356,"ch":357,"imp":358,"ot":359,"002":360,"ĉčĊ":361,"Ġ=":362,"ort":363,"ected":364,"prot":365,"server":366,"protected":367,");":368,"st":369,"code":370,"Ġexp":371,"ion":372,"Ġ15":373,"ase":374,"ial":375,"em":376,"as":377,"aut":378,"hor":379,"to":380,"ation":381,"Ġ+--":382,"Ġ+->":383,"author":384,"authoriz":385,"sc":386,"Ġw":387,"authorization":388,"an":389,"20":390,"iew":391,"Ġto":392,"end":393,"ute":394,"itial":395,"Ġview":396,"ize":397,"ecute":398,"itialize":399,"base":400,"import":401,"age":402,"dat":403,"tex":404,"ur":405,"outputs":406,"text":407,"ac":408,"iyy":409,"pac":410,"tur":411,"retur":412,"return":413,"set":414,"05":415,"23":416,"kage":417,"las":418,"ntext":419,"ro":420,"tend":421,"ure":422,"Ġpr":423,"Ġ07":424,"Ġctcoolgencore":425,"Ġst":426,"context":427,"ents":428,"Ġimp":429,"oced":430,"Ġclas":431,"atem":432,"Ġexecute":433,"Ġextend":434,"Ġinputs":435,"Ġinitialize":436,"Ġ+---":437,"2023":438,"data":439,"package":440,"Ġproced":441,"Ġstatem":442,"Ġclass":443,"Ġextends":444,"Ġprocedure":445,"Ġstatements":446,"ce":447,"eck":448,"check":449,"me":450,"Ġisc":451,"ork":452,"Ġwork":453,"ĉĉčĊ":454,"fer":455,"ime":456,"time":457,"Ġ2":458,"Ġ5":459,"Ġd":460,"Ġset":461,"ence":462,"refer":463,"authorizationcheck":464,"reference":465,"();":466,"Ġ4":467,"Ġn":468,"ont":469,"chan":470,"Ġ27":471,"Ġdont":472,"change":473,"Ġnew":474,"amp":475,"stamp":476,"codes":477,"timestamp":478,"gro":479,"if":480,"ms":481,"man":482,"up":483,"003":484,"comman":485,"group":486,"msg":487,"command":488,"str":489,"ĠĠĠĠĠĠĠĠ":490,"004":491,"ĉĉĠ":492,"Ġ(":493,"hic":494,"pt":495,"Ġ<":496,"orts":497,"Ġwhic":498,"Ġ46":499,"Ġwhich":500,"fo":501,"fro":502,"Ġs":503,"Ġfro":504,"ing":505,"info":506,"string":507,"Ġfrom":508,"11":509,"lt":510,"Ġu":511,"output":512,"Ġoutputs":513,"Ġreturn":514,"Ġgroup":515,"ĠĠĠĠĠ":516,"init":517,"Ġcyyy":518,"Ġ49":519,"31":520,"41":521,"cyy":522,"Ġ\"":523,"Ġserver":524,"Ġprotected":525,"ĠĠĠĠĠĠĠ":526,"006":527,"execute":528,"reas":529,"initialize":530,"Ġmov":531,"sever":532,"Ġexports":533,"1120":534,"Ġuse":535,"reason":536,"severity":537,"au":538,"ber":539,"fau":540,"gl":541,"ok":542,"Ġ}":543,"obal":544,"ctcoolgengl":545,"defau":546,"ialect":547,"emem":548,"Ġ50":549,"cyyy":550,"Ġmove":551,"ctcoolgenglobal":552,"default":553,"emember":554,"08":555,"];":556,"cd":557,"es":558,"ipt":559,"mov":560,"of":561,"ript":562,"sage":563,"tx":564,"val":565,"Ġentity":566,"Ġof":567,"ĠĠĠĠĠĠĠĠĠĠĠ":568,"exp":569,"inval":570,"Ġcase":571,"ubsc":572,"Ġ+>":573,"ĉĉĉčĊ":574,"serid":575,"date":576,"Ġimports":577,"Ġ55":578,"ĠĠĠĠĠĠĠĠĠ":579,"ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ":580,"081":581,"movemember":582,"invalid":583,"ubscript":584,"02":585,"041":586,"131":587,"141":588,"831":589,"9001":590,"9041":591,"9141":592,"9831":593,"cpt":594,"df":595,"dl":596,"dialect":597,"fm":598,"hn":599,"isc":600,"mv":601,"ng":602,"ns":603,"send":604,"ĉĠ":605,"Ġcontext":606,"Ġseverity":607,"ĠĠĠĠĠĠčĊ":608,"one":609,"005":610,"exce":611,"excpt":612,"trans":613,"ĉĉĉĠ":614,"Ġ56":615,"ption":616,"Ġsend":617,"021":618,"dflt":619,"dlng":620,"fmt":621,"hndlng":622,"exception":623,"excptn":624,"\":":625,"))":626,"15":627,"ak":628,"bre":629,"case":630,"el":631,"eq":632,"rent":633,"ssage":634,"subscript":635,"ual":636,"userid":637,"wit":638,"Ġ-":639,"Ġtime":640,"Ġdate":641,"Ġbre":642,"Ġel":643,"007":644,"008":645,"009":646,"Ġmes":647,"Ġcur":648,"ĉĉĉĉĠ":649,"paces":650,"setsubscript":651,"message":652,"Ġ26":653,"Ġdialect":654,"Ġ<=":655,"Ġsubscript":656,"Ġswit":657,"Ġspaces":658,"Ġuserid":659,"150":660,"equal":661,"Ġtimetimestamp":662,"Ġdatetimestamp":663,"Ġbreak":664,"Ġelse":665,"Ġmessage":666,"Ġcurrent":667,"Ġswitch":668,"equals":669}