#version: 0.2
Ġ Ġ
y y
o r
e r
n t
a t
c o
o n
m p
e x
r or
er ror
t r
ĠĠ ĠĠ
e nt
e t
l o
) ;
i n
co mp
on ent
comp onent
i yy
o a
d at
Ġ =
dat a
ex p
lo c
Ġ (
a l
c yy
d e
at tr
o f
h or
Ġ !
v al
u e
val ue
value of
error iyy
s t
co de
ex t
l a
cyy y
s c
Ġ w
o u
c e
g et
in g
s tr
str ing
i sc
0 0
ĠĠĠĠ Ġ
2 1
e n
c h
a n
r e
Ġ f
( )
e d
nt ext
co ntext
i mp
i a
exp erroriyy
t i
string attr
s hor
shor t
* *
v er
i t
s er
st at
u r
i d
r et
t hor
u thor
() .
i e
i x
Ġf ix
ed stringattr
Ġfix edstringattr
error data
b data
lo bdata
g lobdata
s e
it y
r ou
s et
Ġ i
ur n
m e
Ġ "
Ġ )
a r
č Ċ
ĠĠ Ġ
3 1
i on
g rou
s w
grou p
at ion
a uthor
c k
ret urn
v ie
vie w
p ar
or t
Ġ iyy
Ġ loc
Ġ t
i z
stat e
author iz
0 21
ĠĠĠĠ ĠĠĠĠ
( );
r o
loc erroriyy
ti r
in f
0 1
Ġ exp
authoriz ation
tir d
u m
ser ver
nt attr
Ġi ntattr
Ġ view
d o
n d
ch an
do nt
Ġ );
** **
group context
d i
l l
f er
en ce
fer ence
re ference
u nt
a s
4 1
as on
a ce
Ġ cyyy
tr ace
Ġt o
loc groupcontext
i f
Ġ! =
g en
yy y
authorization inf
in st
an ce
inst ance
get errordata
Ġ errordata
re ason
chan g
get state
getstate data
0 2
l e
component return
componentreturn code
Ġ 1
Ġ n
00 1
1 5
1 21
u s
stat us
b le
or k
d ou
dou ble
t ext
de c
code s
ver ity
se verity
par ent
9 8
p s
Ġw ork
error isc
98 31
component severity
componentseverity code
component context
componentcontext string
Ġ 0
d c
component reason
componentreason code
i me
f ou
fou nd
a b
Ġ +
n o
Ġ) {
i l
00 2
b a
g in
i gin
v id
or igin
ĠĠĠĠ ĠĠĠĠĠ
component origin
ser vid
componentorigin servid
e ck
ch eck
ll ba
llba ck
oa uthor
exp isc
ro llback
authorizationinf oauthor
authorizationinfoauthor ity
c at
m an
in di
component rollback
ch il
cat or
indi cator
componentrollback indicator
( "
s um
on e
component check
man d
componentcheck sum
) );
1 1
5 1
n one
ĠĠĠĠ ĠĠĠ
f r
Ġ imp
ie fr
par m
unt ime
iefr untime
iefruntime parm
m mand
co mmand
00 00
ti me
Ġ {
Ġi f
9 1
m a
server data
**** ****
reference iyy
authorizationinfoauthority status
91 41
n um
Ġ }
Ġ dont
chang e
) )
ti on
i nt
Ġ 8
Ġ trace
Ġ globdata
15 0
a mp
st amp
| |
Ġ ||
Ġ <
" ,
Ġ isc
parent p
er ed
co unt
error en
ered sw
count eredsw
erroren counteredsw
u ll
Ġn ull
51 2
c ur
r ent
cur rent
u se
attr text
set current
setcurrent ab
o k
imp erroriyy
Ġ stringattr
Ġ+ -
( (
m ent
comp a
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
time stamp
Ġ tird
loc dont
get instance
rou nd
chang er
locdont changer
b er
loc errorisc
la st
Ġw h
set last
state ment
num ber
statement number
Ġ set
Ġ( (
" ));
) (
e instance
f re
i ch
ort s
Ġwh ich
fre einstance
e y
u n
Ġ cyy
Ġ double
Ġdouble attr
Ġf ro
02 21
chil d
Ġfro m
1 31
ser id
9 001
e c
Ġ 9
imp isc
! !
Ġ ent
Ġent ity
reference id
o ver
m s
dat e
01 21
chil dc
s u
Ġ timestamp
ms g
su b
Ġtimestamp attr
serverdata server
a di
k ey
p tion
ex ce
codes q
adi m
exce ption
9 0
et urn
locdontchanger eturn
2 0
l t
u serid
loc referenceiyy
e w
f lo
h ro
s en
w sw
Ġ ab
view over
Ġn ew
flo wsw
hro w
sen d
Ġab exception
viewover flowsw
******** ********
c tion
Ġ 5
ex it
Ġ+- -
key attrtext
setlast statementnumber
! (
e q
s f
u al
Ġ return
get status
get errorencounteredsw
get viewoverflowsw
imp parentp
set errorencounteredsw
Ġ) ))
Ġ(( !(
ec t
eq ual
equal s
0 3
al l
inf o
Ġ< =
1 0
2 02
a me
a ction
b loc
n ame
o t
exp referenceiyy
Ġexp orts
002 202
use action
setcurrentab id
setcurrentab name
bloc k
useaction block
(); }
a u
f au
Ġ c
de fau
defau lt
g context
y p
Ġ compa
ext text
get exttext
re exit
ret o
chan getexttext
dont changetexttext
compa reto
gcontext dontchangetexttext
Ġcompa reexit
loc imperroriyy
al ect
di alect
instance id
" )
l i
Ġ >
0 9
m o
); }
component send
Ġ= =
exp errorisc
imp errorisc
imp command
Ġ+ >
componentsend command
impcommand iyy
e l
01 11
el se
, (
Ġ of
serverdata referenceid
Ġ+- >
msg iyy
a se
01 31
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
90 41
e sc
f la
exp all
loc gcontextdontchangetexttext
al se
Ġf alse
02 31
002 09
Ġimp orts
un c
locdontchangereturn codesq
03 21
fla g
00209 7
021 1
11 10
setlast sub
!! !!
setlastsub statementnumber
p t
t hrow
02 41
& &
i pt
r ipt
Ġ sub
Ġ &&
sc ript
imp childc
Ġt ext
01 41
Ġsub script
1 7
o p
t yp
v e
Ġ parent
Ġ child
er ation
authoriz ed
un authorized
Ġc ase
mo ve
op eration
; }
Ġ else
ĠĠĠĠĠĠĠĠ ĠĠĠ
0000 0000
11 20
002097 2
e ason
Ġ short
error msgiyy
locdontchanger eason
17 3
locdontchangereason codesq
a in
b j
c re
h er
o bj
Ġ iefruntimeparm
at e
se ar
Ġt hrow
codes n
ma int
locdontchangereturn codesn
002202 01
li ent
cre ate
sear ch
maint ain
g v
r gv
serverdataserver time
serverdataserver date
**************** ****************
173 01
rgv c
2 5
s s
Ġ use
en id
Ġf unc
authorizationinf o
authorizationinf ot
0000 00
ok enid
typ et
search attrtext
authorizationinfot okenid
Ġ1 0
parentp keyattrtext
90 51
+ -
a d
c d
p date
u pdate
Ġ move
tr an
re ad
me ss
ck ey
ime stamp
her attrtext
tran s
mess a
Ġ 3
in it
author ity
Ġloc groupcontext
t s
in val
component messa
attr num
get x
ti d
Ġ1 1
serverdata userid
child ckey
ec tid
expall childc
obj ectid
+- >
inval id
componentmessa getx
childckey attrnum
Ġ reason
Ġ send
exp childc
3 9
Ġ adim
et imestamp
component dialect
exp errormsgiyy
ou serid
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
authorizationinf ouserid
Ġ1 2
)); }
serverdataserver timestamp
!!!! !!!!
componentdialect cd
0 31
0 51
exp parentp
impparentp keyattrtext
unauthorized operation
typet keyattrtext
+ (
t o
Ġ group
context iyy
imp referenceiyy
Ġ+ +(
authorizationinfoauthoritystatus u
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
0 8
^ =
c lient
f unc
u ser
Ġ time
Ġ date
Ġ authority
Ġ ^=
get client
() ,
imp dialect
imp childckeyattrnum
021 9
01 1
authorizationinfoauthoritystatus r
002202 0219
Ġc lient
li st
impchildc parentpkeyattrtext
00220201 39
17301 5
Ġtime attr
Ġdate attr
getclient userid
impdialect iyy
. .
3 2
6 1
a y
d u
d ay
l et
s ion
w ork
in d
exp msgiyy
de let
ing un
it num
Ġt h
01 61
authorizationinf over
le id
authorizationinfoauthority objectid
authorizationinfoauthority ind
authorizationinfoauthoritystatus d
authorizationinfoauthoritystatus l
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
ot herattrtext
mo du
);} }
expall parentp
authorizationinfo work
authorizationinfo modu
delet e
ingun itnum
authorizationinfover sion
authorizationinfowork ingunitnum
authorizationinfomodu leid
0 41
m en
Ġ context
loc errormsgiyy
if i
impparentp instanceid
men u
0 6
8 4
c ation
s p
t herattrtext
Ġ .
Ġ server
Ġ userid
co therattrtext
loc contextiyy
Ġf or
imp group
imp gcontextdontchangetexttext
Ġn ot
child cotherattrtext
Ġ9 3
impchildc instanceid
create userid
17301 512
update userid
invalid command
Ġth e
impgroup trans
Ġnot e
( -
2 8
h il
m in
m etimestamp
t er
t sc
Ġ -
Ġ ********************************
dat etimestamp
exp al
exp tsc
ti metimestamp
lt yp
002202 03
00220201 84
to day
08 2
173015 082
hil dc
min ation
ter mination
Ġ******************************** ********************************
expal ltyp
exptsc hildc
3 0
4 4
] ,
c ase
f p
g trans
Ġ 2
Ġ ;
Ġ severity
exp ort
imp gtrans
set viewoverflowsw
set exit
)) {
impparentp searchattrtext
impparentp typetkeyattrtext
impparentp otherattrtext
ect info
yp e
typ e
obj ectinfo
000000 002
Ġ10 6
authority objectinfo
!!!!!!!! !!!!!!!!
17301512 3
expalltyp et
impgtrans isc
authorityobjectinfo objectid
2 3
8 8
a i
d f
m v
r ai
s ed
} }
Ġ '
Ġ error
Ġ an
Ġ rai
er s
ent ifi
exp typet
exp ts
Ġf un
id entifi
Ġt ype
tir dat
ma in
Ġ9 7
0020972 9
000000 01
Ġ10 8
.. .
00220203 28
today st
Ġrai sed
expts parentp
Ġfun ction
identifi ers
0 4
0 5
a p
f or
h nd
i se
l n
p li
p read
w ise
Ġ ot
Ġ sp
component imp
component sp
exp contextiyy
st d
imp groupcontext
imp childcotherattrtext
Ġi s
ation id
tir f
ace s
le ment
Ġ1 01
Ġ1 20
Ġ1 10
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ec ifi
Ġ9 5
Ġ9 6
Ġ9 9
impparentp referenceid
impchildc referenceid
impchildc searchattrtext
00000000 3
00000000 5
00000000 8
her wise
00220201 06
000000 001
000000 011
Ġ10 5
Ġ11 2
Ġ11 4
Ġ11 8
expallchildc referenceid
expallchildc instanceid
expchildc referenceid
Ġ12 3
Ġ12 8
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
cation id
exptschildc referenceid
df lt
ap pli
hnd ln
Ġot herwise
Ġsp aces
componentimp lement
componentsp ecifi
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
appli cation
hndln g
componentimplement ationid
componentspecifi cationid
! =
e m
s y
s date
Ġ in
exp parentpkeyattrtext
exp identifiers
loc imp
loc impparentpkeyattrtext
attr mand
st em
get sy
00 6
00 8
() );}
() !=
Ġto day
time value
Ġ} }
date value
();} }
;} }
00000000 9
00000000 44
0020972 8
Ġ10 4
expchildc instanceid
expparentp referenceid
expparentp instanceid
expparentp searchattrtext
datetimestamp datevalue
timetimestamp timevalue
exptschildc instanceid
export datetimestampdatevalue
export timetimestamptimevalue
todayst imestamp
exptsparentp referenceid
expidentifiers iyy
getsy stem
0 7
1 2
1 3
1 4
1 6
1 8
1 9
2 2
2 4
2 6
2 7
2 9
5 6
7 4
a c
b e
d t
d one
e mp
e ference
g e
i ti
i ss
m ts
m iss
o llback
p key
q ue
r b
t x
t y
t mts
v ity
Ġ ex
Ġ state
Ġ 98
Ġ 91
Ġ exit
Ġ dialect
Ġ ;}
Ġ ckey
Ġ messa
Ġ datetimestamp
Ġ timetimestamp
Ġ tirdat
Ġ std
Ġ be
Ġ done
or y
tr eference
tr ollback
ĠĠĠĠ ĠĠ
ĠĠĠĠ čĊ
component ac
dat ory
exp childckeyattrnum
exp childcotherattrtext
loc impparentpinstanceid
st ed
ing s
re set
re que
imp ort
ti vity
se attr
se trollback
Ġ" ;}
31 1
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠ
02 39
Ġ1 21
Ġ1 09
15 4
ba seattr
man datory
51 88
Ġ} }}
Ġwh en
msg type
key attrmand
all y
all ed
info msg
10 4
10 5
10 6
002202 0239
Ġc alled
Ġ> =
expall childckeyattrnum
expall childcotherattrtext
002097 3
002097 173
002097 30
00000000 41
00000000 30
0020972 5
0020972 23
0020972 88
0020972 311
17301 5188
typet instanceid
+- -
Ġ3 0
Ġ11 3
expallchildc searchattrtext
expallchildc parentpkeyattrtext
expallchildc createuserid
expallchildc updateuserid
expchildc searchattrtext
expchildc parentpkeyattrtext
expchildc createuserid
expchildc updateuserid
Ġ12 7
173015 05
173015 154
Ġth ings
);}} }
);}} }}
expallparentp referenceid
expallparentp instanceid
expallparentp typetkeyattrtext
17301512 0
00220203 44
today sdate
setexit state
setexit msgtype
setexit infomsg
000000002 3
000000002 7
!!!!!!!!!!!!!!!! !!!!!!!!!!!!!!!!
todayst ime
exptsparentp instanceid
std return
tirf dt
tirf tmts
000000003 7
000000005 7
000000005 9
000000011 8
Ġin iti
locimp typetkeyattrtext
Ġtoday st
emp ty
miss ing
Ġmessa ge
treference id
componentac tivity
reque sted
setrollback requested
002097173 5
002097223 3
17301505 6
tirfdt ts
Ġiniti ally
componentactivity cd
