#version: 0.2
o r
y y
e r
a t
n t
c o
o n
m p
t r
r or
er ror
e x
e nt
e t
) ;
i n
l o
co mp
on ent
comp onent
o a
i yy
d at
Ġ Ġ
dat a
Ġ =
ex p
Ġ (
a l
lo c
c yy
d e
h or
at tr
o f
v al
u e
val ue
s t
value of
co de
error iyy
s c
i sc
c e
l a
g et
cyy y
in g
ex t
0 0
s tr
str ing
o u
e n
2 1
( )
a n
r e
i mp
Ġ !
e d
Ġ f
Ġ w
t i
exp erroriyy
i a
string attr
s hor
shor t
v er
t hor
u thor
uthor i
t y
nt ext
co ntext
st at
s er
c h
() .
r et
v i
u r
i x
ed stringattr
Ġf ix
Ġfix edstringattr
error data
ĠĠ ĠĠ
b data
lo bdata
g lobdata
m e
s e
s et
i on
r ou
at ion
a r
3 1
e w
a uthori
i f
Ġ )
ur n
i nt
p ar
authori z
s w
Ġ "
( );
or t
in f
0 1
authoriz ation
vi ew
a ce
i d
Ġ iyy
0 21
ret urn
c k
tr ace
stat e
č Ċ
ser ver
Ġ loc
g rou
grou p
r o
ti r
authorization inf
t o
d i
Ġ! =
l l
n d
tir d
u nt
Ġ );
Ġ view
Ġ exp
f er
Ġ int
en ce
fer ence
Ġint attr
i ty
re ference
d o
u m
ch an
do nt
Ġ) {
a s
g en
yy y
1 21
get errordata
as on
Ġ to
u s
Ġ errordata
stat us
loc erroriyy
group context
in st
an ce
inst ance
4 1
get state
getstate data
loc groupcontext
par ent
8 31
9 831
error isc
re ason
chan g
00 1
or k
component return
componentreturn code
Ġ n
l e
ver ity
se verity
oa uthori
exp isc
authorizationinf oauthori
authorizationinfoauthori ty
i me
t ext
Ġw ork
1 5
component severity
componentseverity code
de c
code s
2 0
b le
d ou
f ou
n o
dou ble
fou nd
component context
componentcontext string
component reason
componentreason code
1 1
a b
00 00
authorizationinfoauthority status
b a
g in
i gin
or igin
component origin
ser vi
componentorigin servi
componentoriginservi d
( "
ll ba
llba ck
e ck
Ġ 0
Ġ 8
Ġ trace
ch eck
p s
ro llback
c at
e f
i ef
r unt
in di
component rollback
par m
ime parm
cat or
ief runt
indi cator
componentrollback indicator
iefrunt imeparm
ĠĠĠĠ ĠĠĠĠ
) );
n on
s um
component check
ti me
non e
componentcheck sum
5 1
server data
reference iyy
Ġ cyyy
Ġ imp
m an
imp erroriyy
) )
man d
00 2
Ġ +
a mp
st amp
" ,
parent p
m a
m mand
Ġ dont
co mmand
ti on
chang e
9 001
| |
Ġ 1
Ġ ||
er ed
co unt
error en
ered sw
count eredsw
erroren counteredsw
u ll
ĠĠĠĠ Ġ
Ġn ull
c ur
r ent
cur rent
u se
Ġ isc
loc errorisc
set current
setcurrent ab
15 0
51 2
Ġ <
e c
n um
Ġ stringattr
9 1
get instance
1 31
m s
m ent
91 41
9 0
time stamp
ms g
" ));
) (
d c
e instance
f re
h i
Ġ tird
Ġ( (
imp isc
Ġw hi
rou nd
ort s
fre einstance
Ġwhi ch
loc dont
chang er
locdont changer
b er
Ġ cyy
Ġ double
la st
set last
state ment
num ber
Ġdouble attr
statement number
( (
i t
attr text
serverdata server
Ġf ro
Ġfro m
t h
dat e
(); }
Ġ+ -
o k
o ver
ĠĠ Ġ
imp parentp
ty p
comp a
loc imperroriyy
ec t
Ġ set
a di
p tion
u n
Ġ ent
ex ce
loc referenceiyy
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
adi m
Ġent ity
exce ption
0 3
); }
exp referenceiyy
ser id
reference id
codes q
Ġ {
et urn
01 11
locdontchanger eturn
, (
Ġ timestamp
setlast statementnumber
Ġtimestamp attr
! (
a c
e q
e y
f lo
k ey
s f
s u
u al
w sw
Ġ if
Ġ ab
al ect
get view
get status
get errorencounteredsw
set errorencounteredsw
Ġ) ))
01 21
ro w
authorizationinf o
di alect
Ġn ew
90 41
Ġ(( !(
th row
over flo
eq ual
su b
Ġab exception
getview overflo
equal s
getviewoverflo wsw
Ġ 5
inf o
01 31
03 21
a me
b loc
n ame
Ġexp orts
002 20
tion bloc
use ac
setcurrentab id
setcurrentab name
tionbloc k
useac tionblock
Ġ< =
msg iyy
l t
Ġ globdata
exp errorisc
imp errorisc
s en
Ġ }
ex it
01 41
sen d
1 0
Ġ+- -
typ et
key attrtext
; }
u serid
Ġ return
0000 0000
a u
f au
m o
de fau
defau lt
g context
get ext
chan getext
dont changetext
serverdata referenceid
gcontext dontchangetext
gcontextdontchangetext text
l i
al l
2 01
Ġ parent
error msgiyy
00220 201
1 7
b j
o bj
Ġ of
11 20
Ġimp orts
locdontchangereturn codesq
Ġ 9
Ġ >
Ġ compa
loc gcontextdontchangetexttext
re exit
ret o
90 51
compa reto
Ġcompa reexit
p t
s s
tr an
component send
Ġ= =
exp all
imp command
instance id
ime stamp
11 10
17 3
tran s
componentsend command
impcommand iyy
" )
& &
e l
g v
i pt
r gv
r ipt
Ġ c
Ġ text
Ġ sub
Ġ &&
sc ript
Ġ+ >
serverdataserver time
serverdataserver date
173 01
el se
rgv c
Ġsub script
c d
k en
v e
me ss
to ken
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
authorizationinfo token
mo ve
mess a
authorizationinfotoken id
+ -
a se
e ason
locdontchanger eason
setlast sub
Ġ+- >
locdontchangereason codesq
setlastsub statementnumber
9 7
e sc
f la
o p
er ation
et imestamp
component messa
al se
get x
00 20
Ġf alse
ti d
authoriz ed
codes n
)); }
ec tid
un c
un authorized
locdontchangereturn codesn
typet keyattrtext
obj ectid
fla g
op eration
componentmessa getx
0020 97
0 31
3 2
3 9
c re
at e
typ e
+- >
cre ate
2 5
o th
t s
in val
component dialect
exp parentp
exp errormsgiyy
se ar
serverdataserver timestamp
Ġc ase
oth er
inval id
componentdialect cd
sear ch
a in
f unc
Ġ use
authori ty
int ain
ma intain
00220201 39
expall parentp
0 6
6 1
a y
d ay
Ġ iefruntimeparm
in it
ou serid
01 61
authorizationinf ouserid
impparentp keyattrtext
);} }
li ent
002097 2
other attrtext
search attrtext
0 8
m en
p date
u pdate
Ġ 3
Ġ time
Ġ date
Ġ send
Ġ move
loc errormsgiyy
imp dialect
if i
01 1
00220 20
17301 5
men u
Ġtime attr
Ġdate attr
impdialect iyy
+ (
0 41
c ation
d u
s p
s ion
w ork
Ġ group
Ġ adim
Ġ else
in d
exp msgiyy
ing un
imp group
authorizationinf over
le id
authorizationinfoauthority objectid
authorizationinfoauthority ind
0000 00
authorizationinfoauthoritystatus u
serverdata userid
Ġ+ +(
it num
authorizationinfo mo
authorizationinfo work
li st
du leid
ingun itnum
impgroup trans
authorizationinfover sion
authorizationinfomo duleid
authorizationinfowork ingunitnum
( -
m etimestamp
Ġ -
Ġ reason
dat etimestamp
ti metimestamp
Ġloc groupcontext
to day
authorizationinfoauthoritystatus d
authorizationinfoauthoritystatus l
authorizationinfoauthoritystatus r
impparentp instanceid
unauthorized operation
08 2
173015 082
0 5
8 4
a d
f p
g trans
m in
t er
Ġ short
Ġ server
Ġ severity
exp ort
re ad
imp referenceiyy
imp gtrans
context iyy
ĠĠĠĠ ĠĠĠ
set exit
)) {
impparentp typetkeyattrtext
impparentp otherattrtext
impparentp searchattrtext
ect info
00000000 2
00220201 84
obj ectinfo
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
invalid command
authority objectinfo
min ation
ter mination
impgtrans isc
authorityobjectinfo objectid
0 4
4 4
8 8
^ =
c lient
d f
l et
u ser
} }
Ġ '
Ġ 2
Ġ context
Ġ type
Ġ authority
Ġ ^=
er s
ent ifi
exp typet
exp ts
de let
get client
() ,
id entifi
tir dat
ma in
00000000 3
expall typet
Ġc lient
32 8
0022020 328
today st
expts parentp
delet e
getclient userid
identifi ers
] ,
a p
f or
h nd
l n
m v
p li
Ġ throw
Ġ userid
Ġ sp
component imp
component sp
loc contextiyy
st d
imp gcontextdontchangetexttext
Ġf or
ation id
ace s
tir f
le ment
512 3
ec ifi
impparentp referenceid
00220201 06
17301 51
17301 5123
create userid
update userid
cation id
000000 001
df lt
ap pli
hnd ln
Ġsp aces
componentimp lement
componentsp ecifi
appli cation
hndln g
componentimplement ationid
componentspecifi cationid
! =
0 9
2 3
c ase
e m
s y
s date
exp identifiers
loc imp
attr mand
st em
get sy
00 6
00 8
() );}
() !=
Ġf unc
Ġto day
time value
date value
();} }
Ġ} }
;} }
00000000 5
00000000 8
expparentp referenceid
expparentp instanceid
datetimestamp datevalue
timetimestamp timevalue
export datetimestampdatevalue
export timetimestamptimevalue
todayst imestamp
exptsparentp referenceid
expidentifiers iyy
getsy stem
0 2
0 7
1 2
1 3
1 4
1 6
1 8
1 9
2 2
2 4
2 6
2 7
2 8
2 9
2 39
3 0
3 44
7 4
d t
e ference
g e
i s
i se
i ss
m ts
m iss
o llback
q ue
r b
t x
t key
t mts
w ise
Ġ ex
Ġ state
Ġ dialect
Ġ exit
Ġ ;}
Ġ messa
Ġ other
Ġ datetimestamp
Ġ timetimestamp
Ġ tirdat
Ġ std
Ġ is
or y
tr eference
tr ollback
component ac
dat ory
exp contextiyy
st ed
re set
re que
imp ort
imp groupcontext
ti vi
ty cd
se attr
se trollback
Ġ" ;}
ba seattr
ĠĠĠĠĠĠĠĠ ĠĠĠ
man datory
Ġ1 06
Ġ1 05
Ġ1 04
msg type
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠ
key attrmand
info msg
Ġ} }}
10 4
10 5
10 6
typet instanceid
00000000 9
00000000 44
Ġ> =
+- -
002097 25
type treference
expallparentp referenceid
expallparentp instanceid
expallparentp typetkeyattrtext
);}} }
);}} }}
0020972 88
Ġ3 0
0022020 239
0022020 344
173015 05
000000 01
000000 011
today sdate
setexit state
setexit msgtype
setexit infomsg
000000002 3
000000002 7
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
000000003 0
todayst ime
exptsparentp instanceid
std return
tirf dt
tirf tmts
1730151 20
1730151 88
locimp typetkeyattrtext
Ġtoday st
000000005 9
miss ing
Ġmessa ge
Ġother wise
componentac tivi
reque sted
setrollback requested
typetreference id
17301505 6
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
tirfdt ts
componentactivi tycd
